* 创建一个城市 ID 变量
gen city_id = 0

* 批量赋值 city_id 变量
replace city_id = 1 if 城市 == "武汉市" | 城市 == "黄石市" | 城市 == "鄂州市" | 城市 == "黄冈市" | 城市 == "孝感市" | 城市 == "咸宁市" | 城市 == "仙桃市" | 城市 == "潜江市" | 城市 == "天门市" | 城市 == "襄阳市" | 城市 == "宜昌市" | 城市 == "荆州市" | 城市 == "荆门市" | 城市 == "长沙市" | 城市 == "株洲市" | 城市 == "湘潭市" | 城市 == "岳阳市" | 城市 == "益阳市" | 城市 == "常德市" | 城市 == "衡阳市" | 城市 == "娄底市" | 城市 == "南昌市" | 城市 == "九江市" | 城市 == "景德镇市" | 城市 == "鹰潭市" | 城市 == "新余市" | 城市 == "宜春市" | 城市 == "萍乡市" | 城市 == "上饶市" | 城市 == "抚州市" | 城市 == "吉安市"

replace city_id = 2 if 城市 == "哈尔滨市" | 城市 == "大庆市" | 城市 == "齐齐哈尔市" | 城市 == "绥化市" | 城市 == "牡丹江市" | 城市 == "长春市" | 城市 == "吉林市" | 城市 == "四平市" | 城市 == "辽源市" | 城市 == "松原市" | 城市 == "延边朝鲜族自治州"

replace city_id = 3 if 城市 == "成都市" | 城市 == "重庆市" | 城市 == "自贡市" | 城市 == "泸州市" | 城市 == "德阳市" | 城市 == "遂宁市" | 城市 == "内江市" | 城市 == "乐山市" | 城市 == "南充市" | 城市 == "眉山市" | 城市 == "宜宾市" | 城市 == "广安市" | 城市 == "资阳市" | 城市 == "绵阳市" | 城市 == "达州市" | 城市 == "雅安市"

replace city_id = 4 if 城市 == "上海市" | 城市 == "南京市" | 城市 == "无锡市" | 城市 == "常州市" | 城市 == "苏州市" | 城市 == "南通市" | 城市 == "扬州市" | 城市 == "镇江市" | 城市 == "盐城市" | 城市 == "泰州市" | 城市 == "杭州市" | 城市 == "宁波市" | 城市 == "温州市" | 城市 == "湖州市" | 城市 == "嘉兴市" | 城市 == "绍兴市" | 城市 == "金华市" | 城市 == "舟山市" | 城市 == "台州市" | 城市 == "合肥市" | 城市 == "芜湖市" | 城市 == "马鞍山市" | 城市 == "铜陵市" | 城市 == "安庆市" | 城市 == "滁州市" | 城市 == "池州市" | 城市 == "宣城市" | 城市 == "徐州市" | 城市 == "连云港市" | 城市 == "淮安市" | 城市 == "宿迁市" | 城市 == "衢州市" | 城市 == "丽水市" | 城市 == "蚌埠市" | 城市 == "淮南市" | 城市 == "淮北市" | 城市 == "黄山市" | 城市 == "阜阳市" | 城市 == "宿州市" | 城市 == "六安市" | 城市 == "亳州市"

replace city_id = 5 if 城市 == "郑州市" | 城市 == "洛阳市" | 城市 == "开封市" | 城市 == "南阳市" | 城市 == "安阳市" | 城市 == "商丘市" | 城市 == "新乡市" | 城市 == "平顶山市" | 城市 == "许昌市" | 城市 == "焦作市" | 城市 == "周口市" | 城市 == "信阳市" | 城市 == "驻马店市" | 城市 == "鹤壁市" | 城市 == "濮阳市" | 城市 == "漯河市" | 城市 == "三门峡市" | 城市 == "济源市"

replace city_id = 6 if 城市 == "南宁市" | 城市 == "北海市" | 城市 == "钦州市" | 城市 == "防城港市" | 城市 == "玉林市" | 城市 == "崇左市" | 城市 == "湛江市" | 城市 == "茂名市" | 城市 == "阳江市" | 城市 == "海口市" | 城市 == "儋州市" | 城市 == "东方市" | 城市 == "澄迈市" | 城市 == "临高市" | 城市 == "昌江市"

replace city_id = 7 if 城市 == "西安市" | 城市 == "宝鸡市" | 城市 == "咸阳市" | 城市 == "铜川市" | 城市 == "渭南市" | 城市 == "商洛市" | 城市 == "运城市" | 城市 == "临汾市" | 城市 == "天水市" | 城市 == "平凉市" | 城市 == "庆阳市"

replace city_id = 8 if 城市 == "呼和浩特市" | 城市 == "包头市" | 城市 == "鄂尔多斯市" | 城市 == "榆林市"

replace city_id = 9 if 城市 == "兰州市" | 城市 == "西宁市" | 城市 == "海东市" | 城市 == "白银市" | 城市 == "定西市"

replace city_id = 10 if 城市 == "广州市" | 城市 == "深圳市" | 城市 == "佛山市" | 城市 == "东莞市" | 城市 == "中山市" | 城市 == "珠海市" | 城市 == "江门市" | 城市 == "肇庆市" | 城市 == "惠州市"

replace city_id = 11 if 城市 == "北京市" | 城市 == "天津市" | 城市 == "保定市" | 城市 == "唐山市" | 城市 == "廊坊市" | 城市 == "石家庄市" | 城市 == "秦皇岛市" | 城市 == "张家口市" | 城市 == "承德市" | 城市 == "沧州市" | 城市 == "衡水市" | 城市 == "邢台市" | 城市 == "邯郸市"

keep if city_id==0 |city_id==1
